name: "opt-350m-onnx-model"
max_batch_size: 0
platform: "onnxruntime_onnx"
default_model_filename: "model.onnx"

instance_group [
    {
      count: 1
      kind: KIND_CPU
    }
  ] 
input [
    {
        name: "input_ids"
        data_type: TYPE_INT32
        dims: [ -1, -1 ]
    }
]
output [
    {
        name: "output"
        data_type: TYPE_FP32
        dims: [ -1,-1,50272 ]
    }
]
  